Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored.GetSizeInFloats
Gets the amount of storage that the vertex takes up in a buffer, measured in floats.
Returns:
The number of floats occupied by one vertex of this type.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored.SetColor(Autodesk.Revit.DB.ColorWithTransparency)
Sets the vertex's color.
color:
The vertex's color.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored.GetColor
Gets the vertex's color.
Returns:
The vertex's color.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored.Normal
The vertex's normal vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored.Position
The vertex's position.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ColorWithTransparency)
Constructs the vertex from a point, a normal vector, and a color.
position:
The vertex's position.
normal:
The vertex's normal vector.
color:
The vertex's color.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored
A geometry vertex specified as a position in space with a normal vector and a color.
Remarks:
The color of these vertices includes a transparency component
In order to render them as transparent they must be rendered in the transparent pass
See the 'IsTransparentPass' method of Autodesk.Revit.DB.DirectContext3D.DrawContext
Since:
2017